// https://gist.github.com/staltz/868e7e9bc2a7b8c1f754#reactive-programming-is-programming-with-asynchronous-data-streams

/*
"Реактивдүү программалоо деген эмне?"
Интернетте көптөгөн жаман түшүндүрмөлөр жана аныктамалар бар. Wikipedia адаттагыдай өтө жалпы жана теориялык. 
Stackoverflow'тун канондук жообу жаңы келгендер үчүн ылайыктуу эмес. Реактивдүү Манифест сиздин долбоордун 
менеджериңизге же компанияңыздагы бизнесмендерге көрсөткөн нерседей угулат. Майкрософттун Rx терминологиясы 
"Rx = Observables + LINQ + Schedulers" ушунчалык оор жана Microsoftтук болгондуктан, көпчүлүгүбүз чаташып 
калабыз. "Реактивдүү" жана "өзгөрүүнү жайылтуу" сыяктуу терминдер сиздин кадимки MV* жана сүйүктүү 
тилиңизден өзгөчө эч кандай айырманы билдирбейт. Албетте, менин алкактык көз караштарым моделдерге жооп 
берет. Албетте, өзгөртүү жайылтылат. Андай болбосо,

Ошентип, келгиле, шылуундарды кыскарталы.

Реактивдүү программалоо – бул асинхрондук маалымат агымдары менен программалоо.
Мындайча айтканда, бул жаңы нерсе эмес. Окуя автобустары же сиздин типтүү чыкылдатуу окуяларыңыз чындыгында 
асинхрондук окуялар агымы болуп саналат, анда сиз байкап, кээ бир терс таасирлерди жасай аласыз. Реактивдүү бул 
стероиддер боюнча идея. Сиз жөн гана чыкылдатуу жана ачуучу окуялардан эмес, бардык нерселер боюнча маалымат 
агымдарын түзө аласыз. Агымдар арзан жана бардык жерде жеткиликтүү, бардыгы агым болушу мүмкүн: өзгөрмөлөр, 
колдонуучунун киргизүүлөрү, касиеттери, кэштери, маалымат структуралары, ж.б. Мисалы, сиздин Twitter каналыңыз 
чыкылдатуу окуялары сыяктуу эле маалымат агымы болорун элестетиңиз. Сиз ошол агымды угуп, ошого жараша жооп бере 
аласыз.

Анын үстүнө, сизге ошол агымдардын каалаганын бириктирүү, түзүү жана чыпкалоо үчүн укмуштуудай функциялар кутусу 
берилет. "Функционалдуу" сыйкыр дал ушул жерден башталат. Агымды башкасына киргизүү катары колдонсо болот. 
Ал тургай, бир нече агым башка агымга киргизүү катары колдонулушу мүмкүн. Сиз эки агымды бириктире аласыз. 
Сиз агымды чыпкалап , сизди кызыктырган окуялар гана камтылган башкасын алуу үчүн чыпкалай аласыз. Бир агымдан 
башка жаңысына берилиштердин маанилерин картага түшүрө аласыз.
*/
