// https://www.kodeco.com/33931656-rxdart-tutorial-for-flutter-getting-started
// https://github.com/kodecocodes

/*
Өтө жооп берүүчү, каталарга чыдамдуу, масштабдуу болгон окуяга негизделген асинхрондук тиркемелерди 
иштеп чыгуу салттуу синхрондуу программалоо архитектурасынан башкача ой жүгүртүүнү талап кылат.

Мына ошондуктан реактивдүү программалоо принциби бар. Бул реактивдүү тиркемелерди түзүү үчүн 
агымдарды колдонот.

Бул окуу куралында сиз RxDart , реактивдүү программалоо принцибинин Dart ишке ашырылышы, "Gravity Pop" 
программасын иштеп чыгуу үчүн колдоносуз, бул абдан популярдуу блоктук кулаган видеооюндун негизинде 
абдан жөнөкөй оюн. Бул оюнда, блоктор кулап, бир катар толтурулган болсо, жок болот Жолдо сиз үйрөнөсүз:

RxDart агымдары. - > RxDart streams.
Кеңейтүү функциялары. - > Extension functions.
Темалар. - > Subjects.
Арткы басым түшүнүгү. - > The concept of Backpressure.

*/
